Dlubal.TimberPro.BeamType
Type of the beam.

Dlubal.TimberPro.BeamType.BeamTypeUnknown
Unknown type

Dlubal.TimberPro.BeamType.BeamTypeBeam
Beam

Dlubal.TimberPro.BeamType.BeamTypeCantileverStartFree
Cantilever start free

Dlubal.TimberPro.BeamType.BeamTypeCantileverEndFree
Cantilever end free